In [25]:
import pandas as pd
import numpy as np
import random as rnd

In [26]:
trainDataset = pd.read_csv('train.csv')
testDataset = pd.read_csv('test.csv')
combine = [trainDataset, testDataset]

Que 1. Which features are available in the dataset?

In [27]:
print(trainDataset.columns.values)

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

Que 2. Which features are categorical?

Ans: - Categorical: Survived, Sex, and Embarked. Ordinal: Pclass.

Que 3. Which features are numerical?

Ans: - Continous: Age, Fare. Discrete: SibSp, Parch.

Que 4. Which features are mixed data types?

Ans: - Ticket is a mix of numeric and alphanumeric data types. Cabin is alphanumeric.

In [28]:
trainDataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Que 5. Which features contain blank, null or empty values?

Ans: - 
Cabin, Age, Embarked features contain a number of null values in that order for the training dataset.
Cabin, Age are incomplete in case of test dataset.

Que 6. What are the data types (e.g., integer, floats or strings for various features?

Ans: - 
Seven features are integer or floats. Six in case of test dataset.
Five features are strings (object).

In [29]:
trainDataset.info()
print('---'*30)
testDataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
------------------------------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

Que 7. To understand what is the distribution of numerical feature values across the samples, please list the properties (count, mean, std, min, 25% percentile, 50% percentile, 75% percentile, max) of numerical features?

In [30]:
trainDataset.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Que 8. To understand what is the distribution of categorical features, we define: count is the total number of categorical values per column; unique is the total number of unique categorical values per column; top is the most frequent categorical value; freq is the total number of the most frequent categorical value. Please list the properties (count, unique, top, freq) of categorical features?

In [31]:
trainDataset.describe(include=['O'])

                         Name   Sex Ticket    Cabin Embarked
count                     891   891    891      204      889
unique                    891     2    681      147        3
top     Barah, Mr. Hanna Assi  male   1601  B96 B98        S
freq                        1   577      7        4      644